susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32H72.h
#define FMC_NE4_PG12_ PG12,GPIO_AF12
#define _FMC_NE4_PG12_ 1

#define FMC_NL_PB7_ PB7,GPIO_AF12
#define _FMC_NL_PB7_ 1

#define FMC_NOE_PD4_ PD4,GPIO_AF12
#define _FMC_NOE_PD4_ 1

#define FMC_NWAIT_PC6_ PC6,GPIO_AF9
#define FMC_NWAIT_PD6_ PD6,GPIO_AF12
#define _FMC_NWAIT_PC6_ 1
#define _FMC_NWAIT_PD6_ 1

#define FMC_NWE_PD5_ PD5,GPIO_AF12
#define _FMC_NWE_PD5_ 1

#define FMC_SDCKE0_PC3_C_ PC3_C,GPIO_AF12
#define FMC_SDCKE0_PC5_ PC5,GPIO_AF12
#define FMC_SDCKE0_PH2_ PH2,GPIO_AF12
#define _FMC_SDCKE0_PC3_C_ 1
#define _FMC_SDCKE0_PC5_ 1
#define _FMC_SDCKE0_PH2_ 1

#define FMC_SDCKE1_PB5_ PB5,GPIO_AF12
#define FMC_SDCKE1_PH7_ PH7,GPIO_AF12
#define _FMC_SDCKE1_PB5_ 1
#define _FMC_SDCKE1_PH7_ 1

#define FMC_SDCLK_PG8_ PG8,GPIO_AF12
#define _FMC_SDCLK_PG8_ 1

#define FMC_SDNCAS_PG15_ PG15,GPIO_AF12
#define _FMC_SDNCAS_PG15_ 1

#define FMC_SDNE0_PC2_C_ PC2_C,GPIO_AF12
#define FMC_SDNE0_PC4_ PC4,GPIO_AF12
#define FMC_SDNE0_PH3_ PH3,GPIO_AF12
#define _FMC_SDNE0_PC2_C_ 1
#define _FMC_SDNE0_PC4_ 1
#define _FMC_SDNE0_PH3_ 1

#define FMC_SDNE1_PB6_ PB6,GPIO_AF12
#define FMC_SDNE1_PH6_ PH6,GPIO_AF12
#define _FMC_SDNE1_PB6_ 1
#define _FMC_SDNE1_PH6_ 1

#define FMC_SDNRAS_PF11_ PF11,GPIO_AF12
#define _FMC_SDNRAS_PF11_ 1

#define FMC_SDNWE_PA7_ PA7,GPIO_AF12
#define FMC_SDNWE_PC0_ PC0,GPIO_AF12
#define FMC_SDNWE_PH5_ PH5,GPIO_AF12
#define _FMC_SDNWE_PA7_ 1
#define _FMC_SDNWE_PC0_ 1
#define _FMC_SDNWE_PH5_ 1

#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF4
#define I2C2_SCL_PF1_ PF1,GPIO_AF4
#define I2C2_SCL_PH4_ PH4,GPIO_AF4
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PF1_ 1
#define _I2C2_SCL_PH4_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF4
#define I2C2_SDA_PF0_ PF0,GPIO_AF4
#define I2C2_SDA_PH5_ PH5,GPIO_AF4
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PF0_ 1
#define _I2C2_SDA_PH5_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define I2C2_SMBA_PF2_ PF2,GPIO_AF4
#define I2C2_SMBA_PH6_ PH6,GPIO_AF4
#define _I2C2_SMBA_PB12_ 1
#define _I2C2_SMBA_PF2_ 1
#define _I2C2_SMBA_PH6_ 1

#define I2C3_SCL_PA8_ PA8,GPIO_AF4
#define I2C3_SCL_PH7_ PH7,GPIO_AF4
#define _I2C3_SCL_PA8_ 1
#define _I2C3_SCL_PH7_ 1

#define I2C3_SDA_PC9_ PC9,GPIO_AF4
#define I2C3_SDA_PH8_ PH8,GPIO_AF4
#define _I2C3_SDA_PC9_ 1
#define _I2C3_SDA_PH8_ 1

#define I2C3_SMBA_PA9_ PA9,GPIO_AF4
#define I2C3_SMBA_PH9_ PH9,GPIO_AF4
#define _I2C3_SMBA_PA9_ 1
#define _I2C3_SMBA_PH9_ 1

#define I2C4_SCL_PB6_ PB6,GPIO_AF6
#define I2C4_SCL_PB8_ PB8,GPIO_AF6
#define I2C4_SCL_PD12_ PD12,GPIO_AF4
#define I2C4_SCL_PF14_ PF14,GPIO_AF4
#define I2C4_SCL_PH11_ PH11,GPIO_AF4
#define _I2C4_SCL_PB6_ 1
#define _I2C4_SCL_PB8_ 1
#define _I2C4_SCL_PD12_ 1
#define _I2C4_SCL_PF14_ 1
#define _I2C4_SCL_PH11_ 1

#define I2C4_SDA_PB7_ PB7,GPIO_AF6
#define I2C4_SDA_PB9_ PB9,GPIO_AF6
#define I2C4_SDA_PD13_ PD13,GPIO_AF4
#define I2C4_SDA_PF15_ PF15,GPIO_AF4
#define I2C4_SDA_PH12_ PH12,GPIO_AF4
#define _I2C4_SDA_PB7_ 1
#define _I2C4_SDA_PB9_ 1
#define _I2C4_SDA_PD13_ 1
#define _I2C4_SDA_PF15_ 1
#define _I2C4_SDA_PH12_ 1

#define I2C4_SMBA_PB5_ PB5,GPIO_AF6
#define I2C4_SMBA_PB9_ PB9,GPIO_AF11
#define I2C4_SMBA_PD11_ PD11,GPIO_AF4
#define I2C4_SMBA_PF13_ PF13,GPIO_AF4
#define I2C4_SMBA_PH10_ PH10,GPIO_AF4
#define _I2C4_SMBA_PB5_ 1
#define _I2C4_SMBA_PB9_ 1
#define _I2C4_SMBA_PD11_ 1
#define _I2C4_SMBA_PF13_ 1
#define _I2C4_SMBA_PH10_ 1

#define I2C5_SCL_PA8_ PA8,GPIO_AF6
#define I2C5_SCL_PC11_ PC11,GPIO_AF4
#define I2C5_SCL_PF1_ PF1,GPIO_AF6
#define _I2C5_SCL_PA8_ 1
#define _I2C5_SCL_PC11_ 1
#define _I2C5_SCL_PF1_ 1

#define I2C5_SDA_PC10_ PC10,GPIO_AF4
#define I2C5_SDA_PC9_ PC9,GPIO_AF6
#define I2C5_SDA_PF0_ PF0,GPIO_AF6
#define _I2C5_SDA_PC10_ 1
#define _I2C5_SDA_PC9_ 1
#define _I2C5_SDA_PF0_ 1

#define I2C5_SMBA_PA9_ PA9,GPIO_AF6
#define I2C5_SMBA_PC12_ PC12,GPIO_AF4
#define I2C5_SMBA_PF2_ PF2,GPIO_AF6
#define _I2C5_SMBA_PA9_ 1
#define _I2C5_SMBA_PC12_ 1
#define _I2C5_SMBA_PF2_ 1

#define I2S1_CK_PA5_ PA5,GPIO_AF5
#define I2S1_CK_PB3(JTDO/TRACESWO)_ PB3(JTDO/TRACESWO),GPIO_AF5
#define I2S1_CK_PG11_ PG11,GPIO_AF5
#define _I2S1_CK_PA5_ 1
#define _I2S1_CK_PB3(JTDO/TRACESWO)_ 1
#define _I2S1_CK_PG11_ 1

#define I2S1_MCK_PC4_ PC4,GPIO_AF5
#define _I2S1_MCK_PC4_ 1

#define I2S1_SDI_PA6_ PA6,GPIO_AF5
#define I2S1_SDI_PB4(NJTRST)_ PB4(NJTRST),GPIO_AF5
#define I2S1_SDI_PG9_ PG9,GPIO_AF5
#define _I2S1_SDI_PA6_ 1
#define _I2S1_SDI_PB4(NJTRST)_ 1
#define _I2S1_SDI_PG9_ 1

#define I2S1_SDO_PA7_ PA7,GPIO_AF5
#define I2S1_SDO_PB5_ PB5,GPIO_AF5
#define I2S1_SDO_PD7_ PD7,GPIO_AF5
#define _I2S1_SDO_PA7_ 1
#define _I2S1_SDO_PB5_ 1
#define _I2S1_SDO_PD7_ 1

#define I2S1_WS_PA15(JTDI)_ PA15(JTDI),GPIO_AF5
#define I2S1_WS_PA4_ PA4,GPIO_AF5
#define I2S1_WS_PG10_ PG10,GPIO_AF5
#define _I2S1_WS_PA15(JTDI)_ 1
#define _I2S1_WS_PA4_ 1
#define _I2S1_WS_PG10_ 1

#define I2S2_CK_PA12_ PA12,GPIO_AF5
#define I2S2_CK_PA9_ PA9,GPIO_AF5
#define I2S2_CK_PB10_ PB10,GPIO_AF5
#define I2S2_CK_PB13_ PB13,GPIO_AF5
#define I2S2_CK_PD3_ PD3,GPIO_AF5
#define _I2S2_CK_PA12_ 1
#define _I2S2_CK_PA9_ 1
#define _I2S2_CK_PB10_ 1
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PD3_ 1

#define I2S2_MCK_PC6_ PC6,GPIO_AF5
#define _I2S2_MCK_PC6_ 1

#define I2S2_SDI_PB14_ PB14,GPIO_AF5
#define I2S2_SDI_PC2_C_ PC2_C,GPIO_AF5
#define _I2S2_SDI_PB14_ 1
#define _I2S2_SDI_PC2_C_ 1

#define I2S2_SDO_PB15_ PB15,GPIO_AF5
#define I2S2_SDO_PC1_ PC1,GPIO_AF5
#define I2S2_SDO_PC3_C_ PC3_C,GPIO_AF5
#define _I2S2_SDO_PB15_ 1
#define _I2S2_SDO_PC1_ 1
#define _I2S2_SDO_PC3_C_ 1

#define I2S2_WS_PA11_ PA11,GPIO_AF5
#define I2S2_WS_PB12_ PB12,GPIO_AF5
#define I2S2_WS_PB4(NJTRST)_ PB4(NJTRST),GPIO_AF7
#define I2S2_WS_PB9_ PB9,GPIO_AF5
#define _I2S2_WS_PA11_ 1
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PB4(NJTRST)_ 1
#define _I2S2_WS_PB9_ 1

#define I2S3_CK_PB3(JTDO/TRACESWO)_ PB3(JTDO/TRACESWO),GPIO_AF6
#define I2S3_CK_PC10_ PC10,GPIO_AF6
#define _I2S3_CK_PB3(JTDO/TRACESWO)_ 1
#define _I2S3_CK_PC10_ 1

#define I2S3_MCK_PC7_ PC7,GPIO_AF6
#define _I2S3_MCK_PC7_ 1

#define I2S3_SDI_PB4(NJTRST)_ PB4(NJTRST),GPIO_AF6
#define I2S3_SDI_PC11_ PC11,GPIO_AF6
#define _I2S3_SDI_PB4(NJTRST)_ 1
#define _I2S3_SDI_PC11_ 1

#define I2S3_SDO_PB2_ PB2,GPIO_AF7
#define I2S3_SDO_PB5_ PB5,GPIO_AF7
#define I2S3_SDO_PC12_ PC12,GPIO_AF6
#define I2S3_SDO_PD6_ PD6,GPIO_AF5
#define _I2S3_SDO_PB2_ 1
#define _I2S3_SDO_PB5_ 1
#define _I2S3_SDO_PC12_ 1
#define _I2S3_SDO_PD6_ 1

