susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32H72.h
#define LTDC_R6_PA8_ PA8,GPIO_AF14
#define LTDC_R6_PB1_ PB1,GPIO_AF9
#define LTDC_R6_PC12_ PC12,GPIO_AF14
#define LTDC_R6_PE1_ PE1,GPIO_AF14
#define LTDC_R6_PH12_ PH12,GPIO_AF14
#define _LTDC_R6_PA8_ 1
#define _LTDC_R6_PB1_ 1
#define _LTDC_R6_PC12_ 1
#define _LTDC_R6_PE1_ 1
#define _LTDC_R6_PH12_ 1

#define LTDC_R7_PC4_ PC4,GPIO_AF14
#define LTDC_R7_PE15_ PE15,GPIO_AF14
#define LTDC_R7_PG6_ PG6,GPIO_AF14
#define _LTDC_R7_PC4_ 1
#define _LTDC_R7_PE15_ 1
#define _LTDC_R7_PG6_ 1

#define LTDC_VSYNC_PA4_ PA4,GPIO_AF14
#define LTDC_VSYNC_PA7_ PA7,GPIO_AF14
#define _LTDC_VSYNC_PA4_ 1
#define _LTDC_VSYNC_PA7_ 1

#define MDIOS_MDC_PA6_ PA6,GPIO_AF11
#define MDIOS_MDC_PC1_ PC1,GPIO_AF12
#define _MDIOS_MDC_PA6_ 1
#define _MDIOS_MDC_PC1_ 1

#define MDIOS_MDIO_PA10_ PA10,GPIO_AF11
#define MDIOS_MDIO_PA2_ PA2,GPIO_AF12
#define _MDIOS_MDIO_PA10_ 1
#define _MDIOS_MDIO_PA2_ 1

#define OCTOSPIM_P1_CLK_PA3_ PA3,GPIO_AF12
#define OCTOSPIM_P1_CLK_PB2_ PB2,GPIO_AF9
#define OCTOSPIM_P1_CLK_PF10_ PF10,GPIO_AF9
#define _OCTOSPIM_P1_CLK_PA3_ 1
#define _OCTOSPIM_P1_CLK_PB2_ 1
#define _OCTOSPIM_P1_CLK_PF10_ 1

#define OCTOSPIM_P1_DQS_PA1_ PA1,GPIO_AF12
#define OCTOSPIM_P1_DQS_PA1_C_ PA1_C,GPIO_AF12
#define OCTOSPIM_P1_DQS_PB2_ PB2,GPIO_AF10
#define OCTOSPIM_P1_DQS_PC5_ PC5,GPIO_AF10
#define _OCTOSPIM_P1_DQS_PA1_ 1
#define _OCTOSPIM_P1_DQS_PA1_C_ 1
#define _OCTOSPIM_P1_DQS_PB2_ 1
#define _OCTOSPIM_P1_DQS_PC5_ 1

#define OCTOSPIM_P1_IO0_PA2_ PA2,GPIO_AF6
#define OCTOSPIM_P1_IO0_PB1_ PB1,GPIO_AF4
#define OCTOSPIM_P1_IO0_PB12_ PB12,GPIO_AF12
#define OCTOSPIM_P1_IO0_PC3_C_ PC3_C,GPIO_AF9
#define OCTOSPIM_P1_IO0_PC9_ PC9,GPIO_AF9
#define OCTOSPIM_P1_IO0_PD11_ PD11,GPIO_AF9
#define OCTOSPIM_P1_IO0_PF8_ PF8,GPIO_AF10
#define _OCTOSPIM_P1_IO0_PA2_ 1
#define _OCTOSPIM_P1_IO0_PB1_ 1
#define _OCTOSPIM_P1_IO0_PB12_ 1
#define _OCTOSPIM_P1_IO0_PC3_C_ 1
#define _OCTOSPIM_P1_IO0_PC9_ 1
#define _OCTOSPIM_P1_IO0_PD11_ 1
#define _OCTOSPIM_P1_IO0_PF8_ 1

#define OCTOSPIM_P1_IO1_PB0_ PB0,GPIO_AF4
#define OCTOSPIM_P1_IO1_PC10_ PC10,GPIO_AF9
#define OCTOSPIM_P1_IO1_PD12_ PD12,GPIO_AF9
#define OCTOSPIM_P1_IO1_PF9_ PF9,GPIO_AF10
#define _OCTOSPIM_P1_IO1_PB0_ 1
#define _OCTOSPIM_P1_IO1_PC10_ 1
#define _OCTOSPIM_P1_IO1_PD12_ 1
#define _OCTOSPIM_P1_IO1_PF9_ 1

#define OCTOSPIM_P1_IO2_PA3_ PA3,GPIO_AF6
#define OCTOSPIM_P1_IO2_PA7_ PA7,GPIO_AF10
#define OCTOSPIM_P1_IO2_PB13_ PB13,GPIO_AF4
#define OCTOSPIM_P1_IO2_PC2_C_ PC2_C,GPIO_AF9
#define OCTOSPIM_P1_IO2_PE2_ PE2,GPIO_AF9
#define OCTOSPIM_P1_IO2_PF7_ PF7,GPIO_AF10
#define _OCTOSPIM_P1_IO2_PA3_ 1
#define _OCTOSPIM_P1_IO2_PA7_ 1
#define _OCTOSPIM_P1_IO2_PB13_ 1
#define _OCTOSPIM_P1_IO2_PC2_C_ 1
#define _OCTOSPIM_P1_IO2_PE2_ 1
#define _OCTOSPIM_P1_IO2_PF7_ 1

#define OCTOSPIM_P1_IO3_PA1_ PA1,GPIO_AF9
#define OCTOSPIM_P1_IO3_PA1_C_ PA1_C,GPIO_AF9
#define OCTOSPIM_P1_IO3_PA6_ PA6,GPIO_AF6
#define OCTOSPIM_P1_IO3_PD13_ PD13,GPIO_AF9
#define OCTOSPIM_P1_IO3_PF6_ PF6,GPIO_AF10
#define _OCTOSPIM_P1_IO3_PA1_ 1
#define _OCTOSPIM_P1_IO3_PA1_C_ 1
#define _OCTOSPIM_P1_IO3_PA6_ 1
#define _OCTOSPIM_P1_IO3_PD13_ 1
#define _OCTOSPIM_P1_IO3_PF6_ 1

#define OCTOSPIM_P1_IO4_PC1_ PC1,GPIO_AF10
#define OCTOSPIM_P1_IO4_PD4_ PD4,GPIO_AF10
#define OCTOSPIM_P1_IO4_PE7_ PE7,GPIO_AF10
#define OCTOSPIM_P1_IO4_PH2_ PH2,GPIO_AF9
#define _OCTOSPIM_P1_IO4_PC1_ 1
#define _OCTOSPIM_P1_IO4_PD4_ 1
#define _OCTOSPIM_P1_IO4_PE7_ 1
#define _OCTOSPIM_P1_IO4_PH2_ 1

#define OCTOSPIM_P1_IO5_PC2_C_ PC2_C,GPIO_AF4
#define OCTOSPIM_P1_IO5_PD5_ PD5,GPIO_AF10
#define OCTOSPIM_P1_IO5_PE8_ PE8,GPIO_AF10
#define OCTOSPIM_P1_IO5_PH3_ PH3,GPIO_AF9
#define _OCTOSPIM_P1_IO5_PC2_C_ 1
#define _OCTOSPIM_P1_IO5_PD5_ 1
#define _OCTOSPIM_P1_IO5_PE8_ 1
#define _OCTOSPIM_P1_IO5_PH3_ 1

#define OCTOSPIM_P1_IO6_PC3_C_ PC3_C,GPIO_AF4
#define OCTOSPIM_P1_IO6_PD6_ PD6,GPIO_AF10
#define OCTOSPIM_P1_IO6_PE9_ PE9,GPIO_AF10
#define OCTOSPIM_P1_IO6_PG9_ PG9,GPIO_AF9
#define _OCTOSPIM_P1_IO6_PC3_C_ 1
#define _OCTOSPIM_P1_IO6_PD6_ 1
#define _OCTOSPIM_P1_IO6_PE9_ 1
#define _OCTOSPIM_P1_IO6_PG9_ 1

#define OCTOSPIM_P1_IO7_PD7_ PD7,GPIO_AF10
#define OCTOSPIM_P1_IO7_PE10_ PE10,GPIO_AF10
#define OCTOSPIM_P1_IO7_PG14_ PG14,GPIO_AF9
#define _OCTOSPIM_P1_IO7_PD7_ 1
#define _OCTOSPIM_P1_IO7_PE10_ 1
#define _OCTOSPIM_P1_IO7_PG14_ 1

#define OCTOSPIM_P1_NCLK_PB12_ PB12,GPIO_AF3
#define OCTOSPIM_P1_NCLK_PF11_ PF11,GPIO_AF9
#define _OCTOSPIM_P1_NCLK_PB12_ 1
#define _OCTOSPIM_P1_NCLK_PF11_ 1

#define OCTOSPIM_P1_NCS_PB10_ PB10,GPIO_AF9
#define OCTOSPIM_P1_NCS_PB6_ PB6,GPIO_AF10
#define OCTOSPIM_P1_NCS_PC11_ PC11,GPIO_AF9
#define OCTOSPIM_P1_NCS_PE11_ PE11,GPIO_AF11
#define OCTOSPIM_P1_NCS_PG6_ PG6,GPIO_AF10
#define _OCTOSPIM_P1_NCS_PB10_ 1
#define _OCTOSPIM_P1_NCS_PB6_ 1
#define _OCTOSPIM_P1_NCS_PC11_ 1
#define _OCTOSPIM_P1_NCS_PE11_ 1
#define _OCTOSPIM_P1_NCS_PG6_ 1

#define OCTOSPIM_P2_CLK_PF4_ PF4,GPIO_AF9
#define _OCTOSPIM_P2_CLK_PF4_ 1

#define OCTOSPIM_P2_DQS_PF12_ PF12,GPIO_AF9
#define OCTOSPIM_P2_DQS_PG15_ PG15,GPIO_AF9
#define OCTOSPIM_P2_DQS_PG7_ PG7,GPIO_AF9
#define _OCTOSPIM_P2_DQS_PF12_ 1
#define _OCTOSPIM_P2_DQS_PG15_ 1
#define _OCTOSPIM_P2_DQS_PG7_ 1

#define OCTOSPIM_P2_IO0_PF0_ PF0,GPIO_AF9
#define _OCTOSPIM_P2_IO0_PF0_ 1

#define OCTOSPIM_P2_IO1_PF1_ PF1,GPIO_AF9
#define _OCTOSPIM_P2_IO1_PF1_ 1

#define OCTOSPIM_P2_IO2_PF2_ PF2,GPIO_AF9
#define _OCTOSPIM_P2_IO2_PF2_ 1

#define OCTOSPIM_P2_IO3_PF3_ PF3,GPIO_AF9
#define _OCTOSPIM_P2_IO3_PF3_ 1

#define OCTOSPIM_P2_IO4_PG0_ PG0,GPIO_AF9
#define _OCTOSPIM_P2_IO4_PG0_ 1

#define OCTOSPIM_P2_IO5_PG1_ PG1,GPIO_AF9
#define _OCTOSPIM_P2_IO5_PG1_ 1

#define OCTOSPIM_P2_IO6_PG10_ PG10,GPIO_AF3
#define _OCTOSPIM_P2_IO6_PG10_ 1

#define OCTOSPIM_P2_IO7_PG11_ PG11,GPIO_AF9
#define _OCTOSPIM_P2_IO7_PG11_ 1

#define OCTOSPIM_P2_NCLK_PF5_ PF5,GPIO_AF9
#define _OCTOSPIM_P2_NCLK_PF5_ 1

#define OCTOSPIM_P2_NCS_PG12_ PG12,GPIO_AF3
#define _OCTOSPIM_P2_NCS_PG12_ 1

#define PSSI_D0_PA9_ PA9,GPIO_AF13
#define PSSI_D0_PC6_ PC6,GPIO_AF13
#define PSSI_D0_PH9_ PH9,GPIO_AF13
#define _PSSI_D0_PA9_ 1
#define _PSSI_D0_PC6_ 1
#define _PSSI_D0_PH9_ 1

#define PSSI_D1_PA10_ PA10,GPIO_AF13
#define PSSI_D1_PC7_ PC7,GPIO_AF13
#define PSSI_D1_PH10_ PH10,GPIO_AF13
#define _PSSI_D1_PA10_ 1
#define _PSSI_D1_PC7_ 1
#define _PSSI_D1_PH10_ 1

