susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32H72.h
#define PSSI_D10_PB5_ PB5,GPIO_AF13
#define PSSI_D10_PD6_ PD6,GPIO_AF13
#define _PSSI_D10_PB5_ 1
#define _PSSI_D10_PD6_ 1

#define PSSI_D11_PD2_ PD2,GPIO_AF13
#define PSSI_D11_PF10_ PF10,GPIO_AF13
#define PSSI_D11_PH15_ PH15,GPIO_AF13
#define _PSSI_D11_PD2_ 1
#define _PSSI_D11_PF10_ 1
#define _PSSI_D11_PH15_ 1

#define PSSI_D12_PD12_ PD12,GPIO_AF13
#define PSSI_D12_PF11_ PF11,GPIO_AF13
#define PSSI_D12_PG6_ PG6,GPIO_AF13
#define _PSSI_D12_PD12_ 1
#define _PSSI_D12_PF11_ 1
#define _PSSI_D12_PG6_ 1

#define PSSI_D13_PD13_ PD13,GPIO_AF13
#define PSSI_D13_PG15_ PG15,GPIO_AF13
#define PSSI_D13_PG7_ PG7,GPIO_AF13
#define _PSSI_D13_PD13_ 1
#define _PSSI_D13_PG15_ 1
#define _PSSI_D13_PG7_ 1

#define PSSI_D14_PA5_ PA5,GPIO_AF13
#define PSSI_D14_PH4_ PH4,GPIO_AF13
#define _PSSI_D14_PA5_ 1
#define _PSSI_D14_PH4_ 1

#define PSSI_D15_PC5_ PC5,GPIO_AF4
#define PSSI_D15_PF10_ PF10,GPIO_AF4
#define _PSSI_D15_PC5_ 1
#define _PSSI_D15_PF10_ 1

#define PSSI_D2_PB13_ PB13,GPIO_AF13
#define PSSI_D2_PC8_ PC8,GPIO_AF13
#define PSSI_D2_PE0_ PE0,GPIO_AF13
#define PSSI_D2_PG10_ PG10,GPIO_AF13
#define PSSI_D2_PH11_ PH11,GPIO_AF13
#define _PSSI_D2_PB13_ 1
#define _PSSI_D2_PC8_ 1
#define _PSSI_D2_PE0_ 1
#define _PSSI_D2_PG10_ 1
#define _PSSI_D2_PH11_ 1

#define PSSI_D3_PC9_ PC9,GPIO_AF13
#define PSSI_D3_PE1_ PE1,GPIO_AF13
#define PSSI_D3_PG11_ PG11,GPIO_AF13
#define PSSI_D3_PH12_ PH12,GPIO_AF13
#define _PSSI_D3_PC9_ 1
#define _PSSI_D3_PE1_ 1
#define _PSSI_D3_PG11_ 1
#define _PSSI_D3_PH12_ 1

#define PSSI_D4_PC11_ PC11,GPIO_AF13
#define PSSI_D4_PE4_ PE4,GPIO_AF13
#define PSSI_D4_PH14_ PH14,GPIO_AF13
#define _PSSI_D4_PC11_ 1
#define _PSSI_D4_PE4_ 1
#define _PSSI_D4_PH14_ 1

#define PSSI_D5_PB6_ PB6,GPIO_AF13
#define PSSI_D5_PD3_ PD3,GPIO_AF13
#define _PSSI_D5_PB6_ 1
#define _PSSI_D5_PD3_ 1

#define PSSI_D6_PB8_ PB8,GPIO_AF13
#define PSSI_D6_PE5_ PE5,GPIO_AF13
#define _PSSI_D6_PB8_ 1
#define _PSSI_D6_PE5_ 1

#define PSSI_D7_PB9_ PB9,GPIO_AF13
#define PSSI_D7_PE6_ PE6,GPIO_AF13
#define _PSSI_D7_PB9_ 1
#define _PSSI_D7_PE6_ 1

#define PSSI_D8_PC10_ PC10,GPIO_AF13
#define PSSI_D8_PH6_ PH6,GPIO_AF13
#define _PSSI_D8_PC10_ 1
#define _PSSI_D8_PH6_ 1

#define PSSI_D9_PC12_ PC12,GPIO_AF13
#define PSSI_D9_PH7_ PH7,GPIO_AF13
#define _PSSI_D9_PC12_ 1
#define _PSSI_D9_PH7_ 1

#define PSSI_DE_PA4_ PA4,GPIO_AF13
#define PSSI_DE_PH8_ PH8,GPIO_AF13
#define _PSSI_DE_PA4_ 1
#define _PSSI_DE_PH8_ 1

#define PSSI_PDCK_PA6_ PA6,GPIO_AF13
#define _PSSI_PDCK_PA6_ 1

#define PSSI_RDY_PB7_ PB7,GPIO_AF13
#define PSSI_RDY_PG9_ PG9,GPIO_AF13
#define _PSSI_RDY_PB7_ 1
#define _PSSI_RDY_PG9_ 1

#define RCC_MCO_1_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_1_PA8_ 1

#define RCC_MCO_2_PC9_ PC9,GPIO_AF0
#define _RCC_MCO_2_PC9_ 1

#define RTC_OUT_ALARM_PB2_ PB2,GPIO_AF0
#define _RTC_OUT_ALARM_PB2_ 1

#define RTC_OUT_CALIB_PB2_ PB2,GPIO_AF0
#define _RTC_OUT_CALIB_PB2_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

#define SAI1_CK1_PE2_ PE2,GPIO_AF2
#define _SAI1_CK1_PE2_ 1

#define SAI1_CK2_PE5_ PE5,GPIO_AF2
#define _SAI1_CK2_PE5_ 1

#define SAI1_D1_PB2_ PB2,GPIO_AF2
#define SAI1_D1_PC1_ PC1,GPIO_AF2
#define SAI1_D1_PD6_ PD6,GPIO_AF2
#define SAI1_D1_PE6_ PE6,GPIO_AF2
#define _SAI1_D1_PB2_ 1
#define _SAI1_D1_PC1_ 1
#define _SAI1_D1_PD6_ 1
#define _SAI1_D1_PE6_ 1

#define SAI1_D2_PE4_ PE4,GPIO_AF2
#define _SAI1_D2_PE4_ 1

#define SAI1_D3_PC5_ PC5,GPIO_AF2
#define SAI1_D3_PF10_ PF10,GPIO_AF2
#define _SAI1_D3_PC5_ 1
#define _SAI1_D3_PF10_ 1

#define SAI1_FS_A_PE4_ PE4,GPIO_AF6
#define _SAI1_FS_A_PE4_ 1

#define SAI1_FS_B_PF9_ PF9,GPIO_AF6
#define _SAI1_FS_B_PF9_ 1

#define SAI1_MCLK_A_PE2_ PE2,GPIO_AF6
#define SAI1_MCLK_A_PG7_ PG7,GPIO_AF6
#define _SAI1_MCLK_A_PE2_ 1
#define _SAI1_MCLK_A_PG7_ 1

#define SAI1_MCLK_B_PF7_ PF7,GPIO_AF6
#define _SAI1_MCLK_B_PF7_ 1

#define SAI1_SCK_A_PE5_ PE5,GPIO_AF6
#define _SAI1_SCK_A_PE5_ 1

#define SAI1_SCK_B_PF8_ PF8,GPIO_AF6
#define _SAI1_SCK_B_PF8_ 1

#define SAI1_SD_A_PB2_ PB2,GPIO_AF6
#define SAI1_SD_A_PC1_ PC1,GPIO_AF6
#define SAI1_SD_A_PD6_ PD6,GPIO_AF6
#define SAI1_SD_A_PE6_ PE6,GPIO_AF6
#define _SAI1_SD_A_PB2_ 1
#define _SAI1_SD_A_PC1_ 1
#define _SAI1_SD_A_PD6_ 1
#define _SAI1_SD_A_PE6_ 1

#define SAI1_SD_B_PE3_ PE3,GPIO_AF6
#define SAI1_SD_B_PF6_ PF6,GPIO_AF6
#define _SAI1_SD_B_PE3_ 1
#define _SAI1_SD_B_PF6_ 1

#define SAI4_CK1_PE2_ PE2,GPIO_AF10
#define _SAI4_CK1_PE2_ 1

#define SAI4_CK2_PE5_ PE5,GPIO_AF10
#define _SAI4_CK2_PE5_ 1

#define SAI4_D1_PB2_ PB2,GPIO_AF1
#define SAI4_D1_PC1_ PC1,GPIO_AF1
#define SAI4_D1_PD6_ PD6,GPIO_AF1
#define SAI4_D1_PE6_ PE6,GPIO_AF9
#define _SAI4_D1_PB2_ 1
#define _SAI4_D1_PC1_ 1
#define _SAI4_D1_PD6_ 1
#define _SAI4_D1_PE6_ 1

#define SAI4_D2_PE4_ PE4,GPIO_AF10
#define _SAI4_D2_PE4_ 1

#define SAI4_D3_PC5_ PC5,GPIO_AF1
#define SAI4_D3_PF10_ PF10,GPIO_AF10
#define _SAI4_D3_PC5_ 1
#define _SAI4_D3_PF10_ 1

#define SAI4_FS_A_PD12_ PD12,GPIO_AF10
#define SAI4_FS_A_PE4_ PE4,GPIO_AF8
#define _SAI4_FS_A_PD12_ 1
#define _SAI4_FS_A_PE4_ 1

#define SAI4_FS_B_PA12_ PA12,GPIO_AF8
#define SAI4_FS_B_PC0_ PC0,GPIO_AF8
#define SAI4_FS_B_PE13_ PE13,GPIO_AF10
#define SAI4_FS_B_PF9_ PF9,GPIO_AF8
#define SAI4_FS_B_PG9_ PG9,GPIO_AF10
#define _SAI4_FS_B_PA12_ 1
#define _SAI4_FS_B_PC0_ 1
#define _SAI4_FS_B_PE13_ 1
#define _SAI4_FS_B_PF9_ 1
#define _SAI4_FS_B_PG9_ 1

#define SAI4_MCLK_A_PE0_ PE0,GPIO_AF10
#define SAI4_MCLK_A_PE2_ PE2,GPIO_AF8
#define _SAI4_MCLK_A_PE0_ 1
#define _SAI4_MCLK_A_PE2_ 1

#define SAI4_MCLK_B_PA1_ PA1,GPIO_AF10
#define SAI4_MCLK_B_PA1_C_ PA1_C,GPIO_AF10
#define SAI4_MCLK_B_PE14_ PE14,GPIO_AF10
#define SAI4_MCLK_B_PE6_ PE6,GPIO_AF10
#define SAI4_MCLK_B_PF7_ PF7,GPIO_AF8
#define SAI4_MCLK_B_PH3_ PH3,GPIO_AF10
#define _SAI4_MCLK_B_PA1_ 1
#define _SAI4_MCLK_B_PA1_C_ 1
#define _SAI4_MCLK_B_PE14_ 1
#define _SAI4_MCLK_B_PE6_ 1
#define _SAI4_MCLK_B_PF7_ 1
#define _SAI4_MCLK_B_PH3_ 1

#define SAI4_SCK_A_PD13_ PD13,GPIO_AF10
#define SAI4_SCK_A_PE5_ PE5,GPIO_AF8
#define _SAI4_SCK_A_PD13_ 1
#define _SAI4_SCK_A_PE5_ 1

#define SAI4_SCK_B_PA2_ PA2,GPIO_AF8
#define SAI4_SCK_B_PE12_ PE12,GPIO_AF10
#define SAI4_SCK_B_PF8_ PF8,GPIO_AF8
#define SAI4_SCK_B_PH2_ PH2,GPIO_AF10
#define _SAI4_SCK_B_PA2_ 1
#define _SAI4_SCK_B_PE12_ 1
#define _SAI4_SCK_B_PF8_ 1
#define _SAI4_SCK_B_PH2_ 1

#define SAI4_SD_A_PB2_ PB2,GPIO_AF8
#define SAI4_SD_A_PC1_ PC1,GPIO_AF8
#define SAI4_SD_A_PD11_ PD11,GPIO_AF10
#define SAI4_SD_A_PD6_ PD6,GPIO_AF8
#define SAI4_SD_A_PE6_ PE6,GPIO_AF8
#define _SAI4_SD_A_PB2_ 1
#define _SAI4_SD_A_PC1_ 1
#define _SAI4_SD_A_PD11_ 1
#define _SAI4_SD_A_PD6_ 1
#define _SAI4_SD_A_PE6_ 1

#define SAI4_SD_B_PA0_ PA0,GPIO_AF10
#define SAI4_SD_B_PA0_C_ PA0_C,GPIO_AF10
#define SAI4_SD_B_PE11_ PE11,GPIO_AF10
#define SAI4_SD_B_PE3_ PE3,GPIO_AF8
#define SAI4_SD_B_PF11_ PF11,GPIO_AF10
#define SAI4_SD_B_PF6_ PF6,GPIO_AF8
#define SAI4_SD_B_PG10_ PG10,GPIO_AF10
#define _SAI4_SD_B_PA0_ 1
#define _SAI4_SD_B_PA0_C_ 1
#define _SAI4_SD_B_PE11_ 1
#define _SAI4_SD_B_PE3_ 1
#define _SAI4_SD_B_PF11_ 1
#define _SAI4_SD_B_PF6_ 1
#define _SAI4_SD_B_PG10_ 1

#define SDMMC1_CDIR_PB9_ PB9,GPIO_AF7
#define _SDMMC1_CDIR_PB9_ 1

#define SDMMC1_CK_PC12_ PC12,GPIO_AF12
#define _SDMMC1_CK_PC12_ 1

