susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32H72.h
#define SPI6_MOSI_PA7_ PA7,GPIO_AF8
#define SPI6_MOSI_PB5_ PB5,GPIO_AF8
#define SPI6_MOSI_PG14_ PG14,GPIO_AF5
#define _SPI6_MOSI_PA7_ 1
#define _SPI6_MOSI_PB5_ 1
#define _SPI6_MOSI_PG14_ 1

#define SPI6_NSS_PA0_ PA0,GPIO_AF5
#define SPI6_NSS_PA0_C_ PA0_C,GPIO_AF5
#define SPI6_NSS_PA15(JTDI)_ PA15(JTDI),GPIO_AF7
#define SPI6_NSS_PA4_ PA4,GPIO_AF8
#define SPI6_NSS_PG8_ PG8,GPIO_AF5
#define _SPI6_NSS_PA0_ 1
#define _SPI6_NSS_PA0_C_ 1
#define _SPI6_NSS_PA15(JTDI)_ 1
#define _SPI6_NSS_PA4_ 1
#define _SPI6_NSS_PG8_ 1

#define SPI6_SCK_PA5_ PA5,GPIO_AF8
#define SPI6_SCK_PB3(JTDO/TRACESWO)_ PB3(JTDO/TRACESWO),GPIO_AF8
#define SPI6_SCK_PC12_ PC12,GPIO_AF5
#define SPI6_SCK_PG13_ PG13,GPIO_AF5
#define _SPI6_SCK_PA5_ 1
#define _SPI6_SCK_PB3(JTDO/TRACESWO)_ 1
#define _SPI6_SCK_PC12_ 1
#define _SPI6_SCK_PG13_ 1

#define SWPMI1_RX_PC10_ PC10,GPIO_AF11
#define SWPMI1_RX_PC8_ PC8,GPIO_AF11
#define _SWPMI1_RX_PC10_ 1
#define _SWPMI1_RX_PC8_ 1

#define SWPMI1_SUSPEND_PC9_ PC9,GPIO_AF11
#define _SWPMI1_SUSPEND_PC9_ 1

#define SWPMI1_TX_PC7_ PC7,GPIO_AF11
#define _SWPMI1_TX_PC7_ 1

#define TIM12_CH1_PB14_ PB14,GPIO_AF2
#define TIM12_CH1_PH6_ PH6,GPIO_AF2
#define _TIM12_CH1_PB14_ 1
#define _TIM12_CH1_PH6_ 1

#define TIM12_CH2_PB15_ PB15,GPIO_AF2
#define TIM12_CH2_PH9_ PH9,GPIO_AF2
#define _TIM12_CH2_PB15_ 1
#define _TIM12_CH2_PH9_ 1

#define TIM13_CH1_PA6_ PA6,GPIO_AF9
#define TIM13_CH1_PF8_ PF8,GPIO_AF9
#define _TIM13_CH1_PA6_ 1
#define _TIM13_CH1_PF8_ 1

#define TIM14_CH1_PA7_ PA7,GPIO_AF9
#define TIM14_CH1_PF9_ PF9,GPIO_AF9
#define _TIM14_CH1_PA7_ 1
#define _TIM14_CH1_PF9_ 1

#define TIM15_BKIN_PA0_ PA0,GPIO_AF4
#define TIM15_BKIN_PA0_C_ PA0_C,GPIO_AF4
#define TIM15_BKIN_PD2_ PD2,GPIO_AF4
#define TIM15_BKIN_PE3_ PE3,GPIO_AF4
#define _TIM15_BKIN_PA0_ 1
#define _TIM15_BKIN_PA0_C_ 1
#define _TIM15_BKIN_PD2_ 1
#define _TIM15_BKIN_PE3_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF4
#define TIM15_CH1_PC12_ PC12,GPIO_AF2
#define TIM15_CH1_PE5_ PE5,GPIO_AF4
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PC12_ 1
#define _TIM15_CH1_PE5_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF4
#define TIM15_CH1N_PA1_C_ PA1_C,GPIO_AF4
#define TIM15_CH1N_PE4_ PE4,GPIO_AF4
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PA1_C_ 1
#define _TIM15_CH1N_PE4_ 1

#define TIM15_CH2_PA3_ PA3,GPIO_AF4
#define TIM15_CH2_PE6_ PE6,GPIO_AF4
#define _TIM15_CH2_PA3_ 1
#define _TIM15_CH2_PE6_ 1

#define TIM16_BKIN_PB4(NJTRST)_ PB4(NJTRST),GPIO_AF1
#define TIM16_BKIN_PF10_ PF10,GPIO_AF1
#define _TIM16_BKIN_PB4(NJTRST)_ 1
#define _TIM16_BKIN_PF10_ 1

#define TIM16_CH1_PB8_ PB8,GPIO_AF1
#define TIM16_CH1_PF6_ PF6,GPIO_AF1
#define _TIM16_CH1_PB8_ 1
#define _TIM16_CH1_PF6_ 1

#define TIM16_CH1N_PB6_ PB6,GPIO_AF1
#define TIM16_CH1N_PF8_ PF8,GPIO_AF1
#define _TIM16_CH1N_PB6_ 1
#define _TIM16_CH1N_PF8_ 1

#define TIM17_BKIN_PB5_ PB5,GPIO_AF1
#define TIM17_BKIN_PG6_ PG6,GPIO_AF1
#define _TIM17_BKIN_PB5_ 1
#define _TIM17_BKIN_PG6_ 1

#define TIM17_CH1_PB9_ PB9,GPIO_AF1
#define TIM17_CH1_PF7_ PF7,GPIO_AF1
#define _TIM17_CH1_PB9_ 1
#define _TIM17_CH1_PF7_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF1
#define TIM17_CH1N_PF9_ PF9,GPIO_AF1
#define _TIM17_CH1N_PB7_ 1
#define _TIM17_CH1N_PF9_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF1
#define TIM1_BKIN_PB12_ PB12,GPIO_AF1
#define TIM1_BKIN_PE15_ PE15,GPIO_AF1
#define TIM1_BKIN_PK2_ PK2,GPIO_AF1
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB12_ 1
#define _TIM1_BKIN_PE15_ 1
#define _TIM1_BKIN_PK2_ 1

#define TIM1_BKIN2_PA12_ PA12,GPIO_AF12
#define TIM1_BKIN2_PE6_ PE6,GPIO_AF1
#define TIM1_BKIN2_PG4_ PG4,GPIO_AF1
#define _TIM1_BKIN2_PA12_ 1
#define _TIM1_BKIN2_PE6_ 1
#define _TIM1_BKIN2_PG4_ 1

#define TIM1_BKIN2_COMP1_PE6_ PE6,GPIO_AF11
#define TIM1_BKIN2_COMP1_PG4_ PG4,GPIO_AF11
#define _TIM1_BKIN2_COMP1_PE6_ 1
#define _TIM1_BKIN2_COMP1_PG4_ 1

#define TIM1_BKIN2_COMP2_PE6_ PE6,GPIO_AF11
#define TIM1_BKIN2_COMP2_PG4_ PG4,GPIO_AF11
#define _TIM1_BKIN2_COMP2_PE6_ 1
#define _TIM1_BKIN2_COMP2_PG4_ 1

#define TIM1_BKIN_COMP1_PA6_ PA6,GPIO_AF12
#define TIM1_BKIN_COMP1_PB12_ PB12,GPIO_AF13
#define TIM1_BKIN_COMP1_PE15_ PE15,GPIO_AF13
#define TIM1_BKIN_COMP1_PK2_ PK2,GPIO_AF11
#define _TIM1_BKIN_COMP1_PA6_ 1
#define _TIM1_BKIN_COMP1_PB12_ 1
#define _TIM1_BKIN_COMP1_PE15_ 1
#define _TIM1_BKIN_COMP1_PK2_ 1

#define TIM1_BKIN_COMP2_PA6_ PA6,GPIO_AF12
#define TIM1_BKIN_COMP2_PB12_ PB12,GPIO_AF13
#define TIM1_BKIN_COMP2_PE15_ PE15,GPIO_AF13
#define TIM1_BKIN_COMP2_PK2_ PK2,GPIO_AF11
#define _TIM1_BKIN_COMP2_PA6_ 1
#define _TIM1_BKIN_COMP2_PB12_ 1
#define _TIM1_BKIN_COMP2_PE15_ 1
#define _TIM1_BKIN_COMP2_PK2_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF1
#define TIM1_CH1_PE9_ PE9,GPIO_AF1
#define TIM1_CH1_PK1_ PK1,GPIO_AF1
#define _TIM1_CH1_PA8_ 1
#define _TIM1_CH1_PE9_ 1
#define _TIM1_CH1_PK1_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF1
#define TIM1_CH1N_PB13_ PB13,GPIO_AF1
#define TIM1_CH1N_PE8_ PE8,GPIO_AF1
#define TIM1_CH1N_PK0_ PK0,GPIO_AF1
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1
#define _TIM1_CH1N_PE8_ 1
#define _TIM1_CH1N_PK0_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF1
#define TIM1_CH2_PE11_ PE11,GPIO_AF1
#define TIM1_CH2_PJ11_ PJ11,GPIO_AF1
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PE11_ 1
#define _TIM1_CH2_PJ11_ 1

#define TIM1_CH2N_PB0_ PB0,GPIO_AF1
#define TIM1_CH2N_PB14_ PB14,GPIO_AF1
#define TIM1_CH2N_PE10_ PE10,GPIO_AF1
#define TIM1_CH2N_PJ10_ PJ10,GPIO_AF1
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1
#define _TIM1_CH2N_PE10_ 1
#define _TIM1_CH2N_PJ10_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF1
#define TIM1_CH3_PE13_ PE13,GPIO_AF1
#define TIM1_CH3_PJ9_ PJ9,GPIO_AF1
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PE13_ 1
#define _TIM1_CH3_PJ9_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF1
#define TIM1_CH3N_PB15_ PB15,GPIO_AF1
#define TIM1_CH3N_PE12_ PE12,GPIO_AF1
#define TIM1_CH3N_PJ8_ PJ8,GPIO_AF1
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1
#define _TIM1_CH3N_PE12_ 1
#define _TIM1_CH3N_PJ8_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF1
#define TIM1_CH4_PE14_ PE14,GPIO_AF1
#define _TIM1_CH4_PA11_ 1
#define _TIM1_CH4_PE14_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF1
#define TIM1_ETR_PE7_ PE7,GPIO_AF1
#define TIM1_ETR_PG5_ PG5,GPIO_AF1
#define _TIM1_ETR_PA12_ 1
#define _TIM1_ETR_PE7_ 1
#define _TIM1_ETR_PG5_ 1

#define TIM23_CH1_PF0_ PF0,GPIO_AF13
#define TIM23_CH1_PF6_ PF6,GPIO_AF13
#define TIM23_CH1_PG12_ PG12,GPIO_AF13
#define _TIM23_CH1_PF0_ 1
#define _TIM23_CH1_PF6_ 1
#define _TIM23_CH1_PG12_ 1

#define TIM23_CH2_PF1_ PF1,GPIO_AF13
#define TIM23_CH2_PF7_ PF7,GPIO_AF13
#define TIM23_CH2_PG13_ PG13,GPIO_AF13
#define _TIM23_CH2_PF1_ 1
#define _TIM23_CH2_PF7_ 1
#define _TIM23_CH2_PG13_ 1

#define TIM23_CH3_PF2_ PF2,GPIO_AF13
#define TIM23_CH3_PF8_ PF8,GPIO_AF13
#define TIM23_CH3_PG14_ PG14,GPIO_AF13
#define _TIM23_CH3_PF2_ 1
#define _TIM23_CH3_PF8_ 1
#define _TIM23_CH3_PG14_ 1

#define TIM23_CH4_PF3_ PF3,GPIO_AF13
#define TIM23_CH4_PF9_ PF9,GPIO_AF13
#define _TIM23_CH4_PF3_ 1
#define _TIM23_CH4_PF9_ 1

#define TIM23_ETR_PB2_ PB2,GPIO_AF13
#define TIM23_ETR_PG3_ PG3,GPIO_AF13
#define _TIM23_ETR_PB2_ 1
#define _TIM23_ETR_PG3_ 1

