susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32H72.h
#define TIM24_CH1_PF11_ PF11,GPIO_AF14
#define _TIM24_CH1_PF11_ 1

#define TIM24_CH2_PF12_ PF12,GPIO_AF14
#define _TIM24_CH2_PF12_ 1

#define TIM24_CH3_PF13_ PF13,GPIO_AF14
#define _TIM24_CH3_PF13_ 1

#define TIM24_CH4_PF14_ PF14,GPIO_AF14
#define _TIM24_CH4_PF14_ 1

#define TIM24_ETR_PB3(JTDO/TRACESWO)_ PB3(JTDO/TRACESWO),GPIO_AF14
#define TIM24_ETR_PG2_ PG2,GPIO_AF14
#define _TIM24_ETR_PB3(JTDO/TRACESWO)_ 1
#define _TIM24_ETR_PG2_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA0_C_ PA0_C,GPIO_AF1
#define TIM2_CH1_PA15(JTDI)_ PA15(JTDI),GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA0_C_ 1
#define _TIM2_CH1_PA15(JTDI)_ 1
#define _TIM2_CH1_PA5_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PA1_C_ PA1_C,GPIO_AF1
#define TIM2_CH2_PB3(JTDO/TRACESWO)_ PB3(JTDO/TRACESWO),GPIO_AF1
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PA1_C_ 1
#define _TIM2_CH2_PB3(JTDO/TRACESWO)_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PB10_ PB10,GPIO_AF1
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define TIM2_CH4_PB11_ PB11,GPIO_AF1
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF1
#define TIM2_ETR_PA0_C_ PA0_C,GPIO_AF1
#define TIM2_ETR_PA15(JTDI)_ PA15(JTDI),GPIO_AF1
#define TIM2_ETR_PA5_ PA5,GPIO_AF1
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA0_C_ 1
#define _TIM2_ETR_PA15(JTDI)_ 1
#define _TIM2_ETR_PA5_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF2
#define TIM3_CH1_PB4(NJTRST)_ PB4(NJTRST),GPIO_AF2
#define TIM3_CH1_PC6_ PC6,GPIO_AF2
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4(NJTRST)_ 1
#define _TIM3_CH1_PC6_ 1

#define TIM3_CH2_PA7_ PA7,GPIO_AF2
#define TIM3_CH2_PB5_ PB5,GPIO_AF2
#define TIM3_CH2_PC7_ PC7,GPIO_AF2
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF2
#define TIM3_CH3_PC8_ PC8,GPIO_AF2
#define _TIM3_CH3_PB0_ 1
#define _TIM3_CH3_PC8_ 1

#define TIM3_CH4_PB1_ PB1,GPIO_AF2
#define TIM3_CH4_PC9_ PC9,GPIO_AF2
#define _TIM3_CH4_PB1_ 1
#define _TIM3_CH4_PC9_ 1

#define TIM3_ETR_PD2_ PD2,GPIO_AF2
#define _TIM3_ETR_PD2_ 1

#define TIM4_CH1_PB6_ PB6,GPIO_AF2
#define TIM4_CH1_PD12_ PD12,GPIO_AF2
#define _TIM4_CH1_PB6_ 1
#define _TIM4_CH1_PD12_ 1

#define TIM4_CH2_PB7_ PB7,GPIO_AF2
#define TIM4_CH2_PD13_ PD13,GPIO_AF2
#define _TIM4_CH2_PB7_ 1
#define _TIM4_CH2_PD13_ 1

#define TIM4_CH3_PB8_ PB8,GPIO_AF2
#define TIM4_CH3_PD14_ PD14,GPIO_AF2
#define _TIM4_CH3_PB8_ 1
#define _TIM4_CH3_PD14_ 1

#define TIM4_CH4_PB9_ PB9,GPIO_AF2
#define TIM4_CH4_PD15_ PD15,GPIO_AF2
#define _TIM4_CH4_PB9_ 1
#define _TIM4_CH4_PD15_ 1

#define TIM4_ETR_PE0_ PE0,GPIO_AF2
#define _TIM4_ETR_PE0_ 1

#define TIM5_CH1_PA0_ PA0,GPIO_AF2
#define TIM5_CH1_PA0_C_ PA0_C,GPIO_AF2
#define TIM5_CH1_PH10_ PH10,GPIO_AF2
#define _TIM5_CH1_PA0_ 1
#define _TIM5_CH1_PA0_C_ 1
#define _TIM5_CH1_PH10_ 1

#define TIM5_CH2_PA1_ PA1,GPIO_AF2
#define TIM5_CH2_PA1_C_ PA1_C,GPIO_AF2
#define TIM5_CH2_PH11_ PH11,GPIO_AF2
#define _TIM5_CH2_PA1_ 1
#define _TIM5_CH2_PA1_C_ 1
#define _TIM5_CH2_PH11_ 1

#define TIM5_CH3_PA2_ PA2,GPIO_AF2
#define TIM5_CH3_PH12_ PH12,GPIO_AF2
#define _TIM5_CH3_PA2_ 1
#define _TIM5_CH3_PH12_ 1

#define TIM5_CH4_PA3_ PA3,GPIO_AF2
#define _TIM5_CH4_PA3_ 1

#define TIM5_ETR_PA4_ PA4,GPIO_AF2
#define TIM5_ETR_PH8_ PH8,GPIO_AF2
#define _TIM5_ETR_PA4_ 1
#define _TIM5_ETR_PH8_ 1

#define TIM8_BKIN_PA6_ PA6,GPIO_AF3
#define TIM8_BKIN_PG2_ PG2,GPIO_AF3
#define TIM8_BKIN_PK2_ PK2,GPIO_AF3
#define _TIM8_BKIN_PA6_ 1
#define _TIM8_BKIN_PG2_ 1
#define _TIM8_BKIN_PK2_ 1

#define TIM8_BKIN2_PA8_ PA8,GPIO_AF3
#define TIM8_BKIN2_PG3_ PG3,GPIO_AF3
#define _TIM8_BKIN2_PA8_ 1
#define _TIM8_BKIN2_PG3_ 1

#define TIM8_BKIN2_COMP1_PA8_ PA8,GPIO_AF12
#define TIM8_BKIN2_COMP1_PG3_ PG3,GPIO_AF11
#define _TIM8_BKIN2_COMP1_PA8_ 1
#define _TIM8_BKIN2_COMP1_PG3_ 1

#define TIM8_BKIN2_COMP2_PA8_ PA8,GPIO_AF12
#define TIM8_BKIN2_COMP2_PG3_ PG3,GPIO_AF11
#define _TIM8_BKIN2_COMP2_PA8_ 1
#define _TIM8_BKIN2_COMP2_PG3_ 1

#define TIM8_BKIN_COMP1_PA6_ PA6,GPIO_AF10
#define TIM8_BKIN_COMP1_PG2_ PG2,GPIO_AF11
#define TIM8_BKIN_COMP1_PK2_ PK2,GPIO_AF10
#define _TIM8_BKIN_COMP1_PA6_ 1
#define _TIM8_BKIN_COMP1_PG2_ 1
#define _TIM8_BKIN_COMP1_PK2_ 1

#define TIM8_BKIN_COMP2_PA6_ PA6,GPIO_AF10
#define TIM8_BKIN_COMP2_PG2_ PG2,GPIO_AF11
#define TIM8_BKIN_COMP2_PK2_ PK2,GPIO_AF10
#define _TIM8_BKIN_COMP2_PA6_ 1
#define _TIM8_BKIN_COMP2_PG2_ 1
#define _TIM8_BKIN_COMP2_PK2_ 1

#define TIM8_CH1_PC6_ PC6,GPIO_AF3
#define TIM8_CH1_PJ8_ PJ8,GPIO_AF3
#define _TIM8_CH1_PC6_ 1
#define _TIM8_CH1_PJ8_ 1

#define TIM8_CH1N_PA5_ PA5,GPIO_AF3
#define TIM8_CH1N_PA7_ PA7,GPIO_AF3
#define TIM8_CH1N_PH13_ PH13,GPIO_AF3
#define TIM8_CH1N_PJ9_ PJ9,GPIO_AF3
#define _TIM8_CH1N_PA5_ 1
#define _TIM8_CH1N_PA7_ 1
#define _TIM8_CH1N_PH13_ 1
#define _TIM8_CH1N_PJ9_ 1

#define TIM8_CH2_PC7_ PC7,GPIO_AF3
#define TIM8_CH2_PJ10_ PJ10,GPIO_AF3
#define _TIM8_CH2_PC7_ 1
#define _TIM8_CH2_PJ10_ 1

#define TIM8_CH2N_PB0_ PB0,GPIO_AF3
#define TIM8_CH2N_PB14_ PB14,GPIO_AF3
#define TIM8_CH2N_PH14_ PH14,GPIO_AF3
#define TIM8_CH2N_PJ11_ PJ11,GPIO_AF3
#define _TIM8_CH2N_PB0_ 1
#define _TIM8_CH2N_PB14_ 1
#define _TIM8_CH2N_PH14_ 1
#define _TIM8_CH2N_PJ11_ 1

#define TIM8_CH3_PC8_ PC8,GPIO_AF3
#define TIM8_CH3_PK0_ PK0,GPIO_AF3
#define _TIM8_CH3_PC8_ 1
#define _TIM8_CH3_PK0_ 1

#define TIM8_CH3N_PB1_ PB1,GPIO_AF3
#define TIM8_CH3N_PB15_ PB15,GPIO_AF3
#define TIM8_CH3N_PH15_ PH15,GPIO_AF3
#define TIM8_CH3N_PK1_ PK1,GPIO_AF3
#define _TIM8_CH3N_PB1_ 1
#define _TIM8_CH3N_PB15_ 1
#define _TIM8_CH3N_PH15_ 1
#define _TIM8_CH3N_PK1_ 1

#define TIM8_CH4_PC9_ PC9,GPIO_AF3
#define _TIM8_CH4_PC9_ 1

#define TIM8_ETR_PA0_ PA0,GPIO_AF3
#define TIM8_ETR_PA0_C_ PA0_C,GPIO_AF3
#define TIM8_ETR_PG8_ PG8,GPIO_AF3
#define _TIM8_ETR_PA0_ 1
#define _TIM8_ETR_PA0_C_ 1
#define _TIM8_ETR_PG8_ 1

#define UART10_CK_PE15_ PE15,GPIO_AF11
#define UART10_CK_PG15_ PG15,GPIO_AF11
#define _UART10_CK_PE15_ 1
#define _UART10_CK_PG15_ 1

#define UART10_CTS_PG13_ PG13,GPIO_AF4
#define _UART10_CTS_PG13_ 1

