susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32H72.h
#define UART10_DE_PG14_ PG14,GPIO_AF4
#define _UART10_DE_PG14_ 1

#define UART10_NSS_PG13_ PG13,GPIO_AF4
#define _UART10_NSS_PG13_ 1

#define UART10_RTS_PG14_ PG14,GPIO_AF4
#define _UART10_RTS_PG14_ 1

#define UART10_RX_PE2_ PE2,GPIO_AF4
#define UART10_RX_PG11_ PG11,GPIO_AF4
#define _UART10_RX_PE2_ 1
#define _UART10_RX_PG11_ 1

#define UART10_TX_PE3_ PE3,GPIO_AF11
#define UART10_TX_PG12_ PG12,GPIO_AF4
#define _UART10_TX_PE3_ 1
#define _UART10_TX_PG12_ 1

#define UART11_CTS_PA11_ PA11,GPIO_AF3
#define _UART11_CTS_PA11_ 1

#define UART11_DE_PA12_ PA12,GPIO_AF3
#define _UART11_DE_PA12_ 1

#define UART11_RTS_PA12_ PA12,GPIO_AF3
#define _UART11_RTS_PA12_ 1

#define UART11_RX_PA10_ PA10,GPIO_AF3
#define UART11_RX_PB7_ PB7,GPIO_AF8
#define _UART11_RX_PA10_ 1
#define _UART11_RX_PB7_ 1

#define UART11_TX_PA9_ PA9,GPIO_AF3
#define UART11_TX_PB6_ PB6,GPIO_AF8
#define _UART11_TX_PA9_ 1
#define _UART11_TX_PB6_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define _UART1_CK_PA8_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define _UART1_CTS_PA11_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define _UART1_DE_PA12_ 1

#define UART1_NSS_PA11_ PA11,GPIO_AF7
#define _UART1_NSS_PA11_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define _UART1_RTS_PA12_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB15_ PB15,GPIO_AF4
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB15_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB14_ PB14,GPIO_AF4
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB14_ 1
#define _UART1_TX_PB6_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF7
#define UART2_CK_PD7_ PD7,GPIO_AF7
#define _UART2_CK_PA4_ 1
#define _UART2_CK_PD7_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF7
#define UART2_CTS_PA0_C_ PA0_C,GPIO_AF7
#define UART2_CTS_PD3_ PD3,GPIO_AF7
#define _UART2_CTS_PA0_ 1
#define _UART2_CTS_PA0_C_ 1
#define _UART2_CTS_PD3_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF7
#define UART2_DE_PA1_C_ PA1_C,GPIO_AF7
#define UART2_DE_PD4_ PD4,GPIO_AF7
#define _UART2_DE_PA1_ 1
#define _UART2_DE_PA1_C_ 1
#define _UART2_DE_PD4_ 1

#define UART2_NSS_PA0_ PA0,GPIO_AF7
#define UART2_NSS_PA0_C_ PA0_C,GPIO_AF7
#define UART2_NSS_PD3_ PD3,GPIO_AF7
#define _UART2_NSS_PA0_ 1
#define _UART2_NSS_PA0_C_ 1
#define _UART2_NSS_PD3_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF7
#define UART2_RTS_PA1_C_ PA1_C,GPIO_AF7
#define UART2_RTS_PD4_ PD4,GPIO_AF7
#define _UART2_RTS_PA1_ 1
#define _UART2_RTS_PA1_C_ 1
#define _UART2_RTS_PD4_ 1

#define UART2_RX_PA3_ PA3,GPIO_AF7
#define UART2_RX_PD6_ PD6,GPIO_AF7
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PD6_ 1

#define UART2_TX_PA2_ PA2,GPIO_AF7
#define UART2_TX_PD5_ PD5,GPIO_AF7
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PD5_ 1

#define UART3_CK_PB12_ PB12,GPIO_AF7
#define UART3_CK_PC12_ PC12,GPIO_AF7
#define UART3_CK_PD10_ PD10,GPIO_AF7
#define _UART3_CK_PB12_ 1
#define _UART3_CK_PC12_ 1
#define _UART3_CK_PD10_ 1

#define UART3_CTS_PB13_ PB13,GPIO_AF7
#define UART3_CTS_PD11_ PD11,GPIO_AF7
#define _UART3_CTS_PB13_ 1
#define _UART3_CTS_PD11_ 1

#define UART3_DE_PB14_ PB14,GPIO_AF7
#define UART3_DE_PD12_ PD12,GPIO_AF7
#define _UART3_DE_PB14_ 1
#define _UART3_DE_PD12_ 1

#define UART3_NSS_PB13_ PB13,GPIO_AF7
#define UART3_NSS_PD11_ PD11,GPIO_AF7
#define _UART3_NSS_PB13_ 1
#define _UART3_NSS_PD11_ 1

#define UART3_RTS_PB14_ PB14,GPIO_AF7
#define UART3_RTS_PD12_ PD12,GPIO_AF7
#define _UART3_RTS_PB14_ 1
#define _UART3_RTS_PD12_ 1

#define UART3_RX_PB11_ PB11,GPIO_AF7
#define UART3_RX_PC11_ PC11,GPIO_AF7
#define UART3_RX_PD9_ PD9,GPIO_AF7
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PC11_ 1
#define _UART3_RX_PD9_ 1

#define UART3_TX_PB10_ PB10,GPIO_AF7
#define UART3_TX_PC10_ PC10,GPIO_AF7
#define UART3_TX_PD8_ PD8,GPIO_AF7
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PD8_ 1

#define UART4_CTS_PB0_ PB0,GPIO_AF8
#define UART4_CTS_PB15_ PB15,GPIO_AF8
#define _UART4_CTS_PB0_ 1
#define _UART4_CTS_PB15_ 1

#define UART4_DE_PA15(JTDI)_ PA15(JTDI),GPIO_AF8
#define UART4_DE_PB14_ PB14,GPIO_AF8
#define _UART4_DE_PA15(JTDI)_ 1
#define _UART4_DE_PB14_ 1

#define UART4_RTS_PA15(JTDI)_ PA15(JTDI),GPIO_AF8
#define UART4_RTS_PB14_ PB14,GPIO_AF8
#define _UART4_RTS_PA15(JTDI)_ 1
#define _UART4_RTS_PB14_ 1

#define UART4_RX_PA1_ PA1,GPIO_AF8
#define UART4_RX_PA11_ PA11,GPIO_AF6
#define UART4_RX_PA1_C_ PA1_C,GPIO_AF8
#define UART4_RX_PB8_ PB8,GPIO_AF8
#define UART4_RX_PC11_ PC11,GPIO_AF8
#define UART4_RX_PD0_ PD0,GPIO_AF8
#define UART4_RX_PH14_ PH14,GPIO_AF8
#define _UART4_RX_PA1_ 1
#define _UART4_RX_PA11_ 1
#define _UART4_RX_PA1_C_ 1
#define _UART4_RX_PB8_ 1
#define _UART4_RX_PC11_ 1
#define _UART4_RX_PD0_ 1
#define _UART4_RX_PH14_ 1

#define UART4_TX_PA0_ PA0,GPIO_AF8
#define UART4_TX_PA0_C_ PA0_C,GPIO_AF8
#define UART4_TX_PA12_ PA12,GPIO_AF6
#define UART4_TX_PB9_ PB9,GPIO_AF8
#define UART4_TX_PC10_ PC10,GPIO_AF8
#define UART4_TX_PD1_ PD1,GPIO_AF8
#define UART4_TX_PH13_ PH13,GPIO_AF8
#define _UART4_TX_PA0_ 1
#define _UART4_TX_PA0_C_ 1
#define _UART4_TX_PA12_ 1
#define _UART4_TX_PB9_ 1
#define _UART4_TX_PC10_ 1
#define _UART4_TX_PD1_ 1
#define _UART4_TX_PH13_ 1

#define UART5_CTS_PC9_ PC9,GPIO_AF8
#define _UART5_CTS_PC9_ 1

#define UART5_DE_PC8_ PC8,GPIO_AF8
#define _UART5_DE_PC8_ 1

#define UART5_RTS_PC8_ PC8,GPIO_AF8
#define _UART5_RTS_PC8_ 1

#define UART5_RX_PB12_ PB12,GPIO_AF14
#define UART5_RX_PB5_ PB5,GPIO_AF14
#define UART5_RX_PD2_ PD2,GPIO_AF8
#define _UART5_RX_PB12_ 1
#define _UART5_RX_PB5_ 1
#define _UART5_RX_PD2_ 1

#define UART5_TX_PB13_ PB13,GPIO_AF14
#define UART5_TX_PB6_ PB6,GPIO_AF14
#define UART5_TX_PC12_ PC12,GPIO_AF8
#define _UART5_TX_PB13_ 1
#define _UART5_TX_PB6_ 1
#define _UART5_TX_PC12_ 1

#define UART6_CK_PC8_ PC8,GPIO_AF7
#define UART6_CK_PG7_ PG7,GPIO_AF7
#define _UART6_CK_PC8_ 1
#define _UART6_CK_PG7_ 1

#define UART6_CTS_PG13_ PG13,GPIO_AF7
#define UART6_CTS_PG15_ PG15,GPIO_AF7
#define _UART6_CTS_PG13_ 1
#define _UART6_CTS_PG15_ 1

#define UART6_DE_PG12_ PG12,GPIO_AF7
#define UART6_DE_PG8_ PG8,GPIO_AF7
#define _UART6_DE_PG12_ 1
#define _UART6_DE_PG8_ 1

#define UART6_NSS_PG13_ PG13,GPIO_AF7
#define UART6_NSS_PG15_ PG15,GPIO_AF7
#define _UART6_NSS_PG13_ 1
#define _UART6_NSS_PG15_ 1

#define UART6_RTS_PG12_ PG12,GPIO_AF7
#define UART6_RTS_PG8_ PG8,GPIO_AF7
#define _UART6_RTS_PG12_ 1
#define _UART6_RTS_PG8_ 1

#define UART6_RX_PC7_ PC7,GPIO_AF7
#define UART6_RX_PG9_ PG9,GPIO_AF7
#define _UART6_RX_PC7_ 1
#define _UART6_RX_PG9_ 1

#define UART6_TX_PC6_ PC6,GPIO_AF7
#define UART6_TX_PG14_ PG14,GPIO_AF7
#define _UART6_TX_PC6_ 1
#define _UART6_TX_PG14_ 1

#define UART7_CTS_PE10_ PE10,GPIO_AF7
#define UART7_CTS_PF9_ PF9,GPIO_AF7
#define _UART7_CTS_PE10_ 1
#define _UART7_CTS_PF9_ 1

#define UART7_DE_PE9_ PE9,GPIO_AF7
#define UART7_DE_PF8_ PF8,GPIO_AF7
#define _UART7_DE_PE9_ 1
#define _UART7_DE_PF8_ 1

#define UART7_RTS_PE9_ PE9,GPIO_AF7
#define UART7_RTS_PF8_ PF8,GPIO_AF7
#define _UART7_RTS_PE9_ 1
#define _UART7_RTS_PF8_ 1

#define UART7_RX_PA8_ PA8,GPIO_AF11
#define UART7_RX_PB3(JTDO/TRACESWO)_ PB3(JTDO/TRACESWO),GPIO_AF11
#define UART7_RX_PE7_ PE7,GPIO_AF7
#define UART7_RX_PF6_ PF6,GPIO_AF7
#define _UART7_RX_PA8_ 1
#define _UART7_RX_PB3(JTDO/TRACESWO)_ 1
#define _UART7_RX_PE7_ 1
#define _UART7_RX_PF6_ 1

#define UART7_TX_PA15(JTDI)_ PA15(JTDI),GPIO_AF11
#define UART7_TX_PB4(NJTRST)_ PB4(NJTRST),GPIO_AF11
#define UART7_TX_PE8_ PE8,GPIO_AF7
#define UART7_TX_PF7_ PF7,GPIO_AF7
#define _UART7_TX_PA15(JTDI)_ 1
#define _UART7_TX_PB4(NJTRST)_ 1
#define _UART7_TX_PE8_ 1
#define _UART7_TX_PF7_ 1

